[["WASHINGTON  During his first term, President Obama rarely brought up the issue of race.", "WASHINGTON During his first term of President Obama rarely raised the question of race."], ["On Thursday, however, he unveiled a program aimed at helping a group he says demands urgent attention  black and Latino young men.", "On Thursday, however, he presented a program to a group helps it requires urgent attention black and Latino young men says."], ["The new program is known as My Brother's Keeper.", "The new program is known as my brother';s keeper."], ["A key part of its mission is to identify and support existing programs that have been successful in helping young minority men stay out of trouble, succeed in school or land good jobs.", "An important part of its mission is to support the identification and existing programs that have been successful in school or country out of trouble young men minority, remain, it is possible to help good jobs."], ["\"So often, the issues facing boys and young men of color get caught up in long-running ideological arguments  about race and class and crime and poverty, the role of government,\" the president said to a packed White House room.", "\"So often, the topics boys and young men of color overlooking get in long-running ideological arguments about race and class and crime and poverty, the role of government caught\" the president said in a crowded White House room."], ["\"But the urgency of the situation requires us to move past some of those old arguments and focus on getting something done and focusing on what works.", "\"But the urgency of the situation requires us to move beyond some of these old arguments and to do something and focus on what works."], ["Doesn't mean the arguments are unimportant; it just means that they can't paralyze us.\"", "That does not mean the arguments do not matter; it just means that they can not paralyze us. \""], ["The new program was shaped in part by two meetings Obama had with a chapter of the Chicago-based group Becoming a Man.", "The new program was partially funded by two sessions shaped Obama with a chapter of the Chicago-based group man Becoming had."], ["Those meetings left a deep impression on both the president and the group's young African-American men.", "This meeting left a deep impression on both the President and the young African-American men in the group."], ["The last time they saw the president, they presented him with a Father's Day card in the Oval Office, leaving him speechless.", "The last time she saw the president, she presented him with a day ticket of the Father in the Oval Office, left him speechless."]]